{
    "details":[
        {
            "line":"Dominic Richard Myers BSc (Hons) MSc (Hons) BCS"
        },
        {
            "line":"19 - 21 Godesdone Road, Cambridge, CB5 8HR"
        },
        {
            "line":"07791005861"
        },
        {
            "line":"annoyingmouse@gmail.com"
        }
    ],
    "Education, qualifications and training": [
        {
            "when": "2012",
            "where": "SalesForce.com",
            "what": [
                {
                    "subject": "DEV401",
                    "grade": "(PASS)"
                }
            ]
        },
        {
            "when": "2009 - 2011",
            "where": "Open University",
            "what": [
                {
                    "subject": "TT280 Web applications: design, development and management",
                    "grade": "(60%)"
                },
                {
                    "subject": "M255 Object-oriented programming with Java",
                    "grade": "(63%/92%)"
                }
            ]
        },
        {
            "when": "2001 - 2006",
            "where": "Anglia Ruskin University",
            "what": [
                {
                    "subject": "MSc(Hons) Computer Science",
                    "grade": "(75%)"
                },
                {
                    "subject": "Design and Implementation of Software Systems",
                    "grade": "(89%)"
                },
                {
                    "subject": "Analysis and Design of Computer Systems",
                    "grade": "(75%)"
                },
                {
                    "subject": "Computer Architecture",
                    "grade": "(58%)"
                },
                {
                    "subject": "Social and Ethical Issues in Computing",
                    "grade": "(66%)"
                },
                {
                    "subject": "Logic and its Applications",
                    "grade": "(85%)"
                },
                {
                    "subject": "Networked Computer Systems",
                    "grade": "(75%)"
                },
                {
                    "subject": "Systems Analysis and Database Design",
                    "grade": "(62%)"
                },
                {
                    "subject": "Development of Object Oriented Systems",
                    "grade": "(69%)"
                },
                {
                    "subject": "Postgraduate Independent Learning Module",
                    "grade": "(48%)"
                },
                {
                    "subject": "Intranets and the Internet",
                    "grade": "(60%)"
                },
                {
                    "subject": "Database Administration",
                    "grade": "(62%)"
                },
                {
                    "subject": "Dissertation: http://www.scribd.com/doc/2205248/Little-Bits-of-Changes",
                    "grade": "(71%)"
                }
            ]
        },
        {
            "when": "1994 - 1998",
            "where": "Anglia Ruskin University",
            "what": [
                {
                    "subject": "BSc (Hons) Professional Nursing Practice"
                },
                {
                    "subject": "ENB Higher Award"
                },
                {
                    "subject": "ENB 960 Principles of Psychiatric Nursing within Secure Environments"
                },
                {
                    "subject": "ENB A30 Enhanced Practice in Mental Health"
                }
            ]
        },
        {
            "when": "1993 - 1994",
            "where": "University of Sheffield",
            "what": [
                {
                    "subject": "Foundation Course in Art Therapy."
                }
            ]
        },
        {
            "when": "1991 - 1994",
            "where": "University of Sheffield",
            "what": [
                {
                    "subject": "Project 2000 Diploma Mental Health Nursing."
                }
            ]
        },
        {
            "when": "1985 - 1990",
            "where": "Shelley High School",
            "what": [
                {
                    "subject": "AS Level General Studies",
                    "grade": "(B)"
                },
                {
                    "subject": "A Level Art & Design",
                    "grade": "(B)"
                },
                {
                    "subject": "GCSE English Language",
                    "grade": "(C)"
                },
                {
                    "subject": "GCSE Law in Society",
                    "grade": "(E)"
                },
                {
                    "subject": "GCSE Art & Design",
                    "grade": "(B)"
                },
                {
                    "subject": "GCSE Biology",
                    "grade": "(D)"
                },
                {
                    "subject": "GCSE Craft, Design & Technology",
                    "grade": "(E)"
                },
                {
                    "subject": "HCSE History",
                    "grade": "(B)"
                },
                {
                    "subject": "GCSE English Language",
                    "grade": "(D)"
                },
                {
                    "subject": " - Oral Communication",
                    "grade": "(1)"
                },
                {
                    "subject": "GCSE English Literature",
                    "grade": "(D)"
                },
                {
                    "subject": "GCSE Mathematics",
                    "grade": "(C)"
                },
                {
                    "subject": "GCSE Statistics",
                    "grade": "(C)"
                },
                {
                    "subject": "GCSE Physics",
                    "grade": "(C)"
                }
            ]
        }
    ],
    "Experiences/achievements": [
        {
            "when": "2011",
            "what": "centrecomms.com - Developed an innovative and money saving approach to emergency communications within the high-pressure environment of shopping centre management."
        },
        {
            "when": "2010 -",
            "what": "Arcus Global Ltd - Cloud Developer for this Cambridge-based start-up providing software, tools and methods that help public sector organisations to run efficient, modern IT  environments for their customers and employees. It is a diverse development role including working with various APIs, web-design, WordPress development, research and the use of CSS, X/HTML, ECMAScript (particularly the jQuery library), PHP and C#. A particular highlight was winning the 2011 MEGA for DataTAP."
        },
        {
            "when": "2010",
            "what": "ACR Partners - Partners Redesigned this site for these specialists in commercial property recruitment, specialising in Shopping Centres, Retail, Leisure, Office and Mixed use schemes."
        },
        {
            "when": "1998 - 2010",
            "what": "Adrian House - Worked as a RMN on nights on Adrian House; an acute admission ward with 24 beds, based at Fulbourn Hospital. The ward admits patients aged 18-65 years for assessment and treatment from the South rural and South City sectors of Cambridgeshire. The ward also had two beds that are used in the treatment of drug and alcohol problems. The philosophy of care reflects a patient-centred approach, with a strong emphasis on a robust, ward-based program of therapeutic activities. Primary nursing is the model through which patient care is organized."
        },
        {
            "when": "2009",
            "what": "Dogrehab - Website for Justyn Hudson who is a Dog Psychologist. Used @font-face (particularly Daniel for the hand-written sign-off, and Century) and hCard in order to recreate and complement the look and feel of his business cards. Again used CushyCMS to enable the client to edit the main content of the site without allowing them to kill the layout (I have moved over to CushyCMS for CambsTREC, Da Cunha Dressage and the Barnwell Driving School)."
        },
        {
            "when": "2009",
            "what": "Barnwell Driving School - Website for Mark Crisp who has been teaching people to drive for just over 10 years in and around the Cambridge and Newmarket area. He teaches a wide range of pupils from the pass plus and fleet assessments. Site built using jQuery and valid XHTML Strict and CSS. The excellent visuals were created by Mark and optimized for screen display by me and the tag soup created by MrSite's WYSIWYG editor was tidied to allow search engines to see the content of the site more easily. The titles of the pages were also made much more descriptive to aid searching."
        },
        {
            "when": "2008",
            "what": "Da Cunha Dressage - Profile website for Jo Lee who teaches and trains people on their horses and is looking to extend her client base. I created a three stage design with a header (with menu), body and footer (with contact details; thus removing the need for a separate contact page). I took a photo of a horse near the river which served as a backdrop to the header with Copper Plate text. jQuery was used to create the sliding menu effect as well as the lightbox gallery. My original colour scheme used colours based upon the header image using color hunter - though the client's specified colour scheme grew on me. Eric Meyer's reset.css is again used to provide a level playing field."
        },
        {
            "when": "2008",
            "what": "Camsticks - Advertisement site for this Cambridge-based stick-making company. Eric Meyer's reset.css used to ensure that users of all browsers have the same experience. Effects are powered using the jQuery library. Graphics are based on Celtic themes (The pattern was designed by myself in the SVG graphics format - it is based on 2 different glyphs which are transformed in order to create a seamless piece of knotwork) with the font being Copper Plate, this combination was used as the client lives afloat and I was seeking to mimic narrowboat sign-writing."
        },
        {
            "when": "2008",
            "what": "CambsTREC - Simple site for a friend. Used Yahoo's reset-min.css and fonts-min.css in order to level the playing field amongst different browsers and Ryan Fait's Sticky Footer in order to keep a set of links at the absolute bottom of each page, unfortunately Yahoo's fonts-min.css kills any attempt at W3C CSS validity. Created the logo for the site in InkScape which is also used as promotional material. Used PHP and TinyMCE to create a text-file based editing facility after failing to teach the user NVU and having her 17 year-old son repeatedly kill the layout. This has now been replaced with http://www.cushycms.com."
        },
        {
            "when": "2007",
            "what": "Fulbourn Hospital - Completed a 10-month secondment as Night-Coordinator, working as the Duty Nursing Officer in this Cambridge psychiatric hospital. I was responsible for managing night-time operations as well as acting as a liaison to the Home Treatment Team. Crisis management is a significant aspect of the role as is the finessing of sometimes-problematic staffing arrangements. Being responsible for a whole hospital rather than a single ward was a challenging but enjoyable experience."
        },
        {
            "when": "2007",
            "what": "Indigo Architecture - Updated site using more traditional approaches and a fluid layout an incorporating SEO techniques. The number of images and the exacting requirements of the client led me to create a PHP script (http://drmsite.com/pictures/pdf/makeSquare.pdf) which automated the creation of thumbnail images of a given aspect ratio and with a suitable background colour."
        },
        {
            "when": "2006",
            "what": "NECT - This site for a charity used ECMAScript to automate page element creation via DOM manipulation. It also utilized lightbox to get greater impact from the number of sumptuous images made available by them. While the exact percentage of users who either disable ECMAScript or use browsers without ECMAScript support is unclear I was keen to further explore the abilities of ECMAScript within this context; especially as the client was unsure about the scripting capabilities of the hosting which he had purchased. The client has updated their site so I took the opportunity to use server- rather than client-side scripting techniques to generate page elements, I host theresult at http://nectuk.drmsite.com."
        },
        {
            "when": "2005",
            "what": "Indigo Architecture - Initially working as a consultant I designed this dynamic single page site for Indigo Architects. The client wanted complete visual control without resorting to proprietary technologies such as Flash. The site is optimized to work on 800 x 600px displays without looking too cramped upon larger ones and uses three slide-shows created using ECMAScript to show examples of the practices' work. Significant care was taken to allow the client to update/alter the site when required; this is reflected in http://indigo05.drmsite.com/resources/readme.txt and general cleanliness of the code. Though Flash is notorious for not being accessible to disabled users the approach I opted for is also problematic as screen-readers do not recognize changes to the structure of the page made after the page is loaded."
        },
        {
            "when": "2003 - 2004",
            "what": "Mike Hobbs - Research assistant working on issues surrounding the semantic web and web ontology, we attended the 6th international Protege workshop in Manchester. The research led to my fascination with ECMAScript and XMLHttpRequest (AJAX) and involved the setting up of a LAMP application stack on a dedicated server."
        },
        {
            "when": "1994 - 1997",
            "what": "Kneesworth House Hospital - Worked as an RMN and consolidated my training within this private forensic psychiatric hospital."
        },
        {
            "when": "1991 - 1992",
            "what": "Broomhall Community Group Member of the Broomhall Community Group Executive Committee in Sheffield."
        },
        {
            "when": "1988 - 1990",
            "what": "Winged Fellowship Trust Worked as a voluntary care assistant with adults with a moderate to severe physical disability in a holiday centre/hotel setting in Southport and Nottingham."
        },
        {
            "when": "1985 - 1988",
            "what": "Turnshaw's Special School Worked on a voluntary basis at a school for children with learning disabilities, some of whom exhibited challenging behaviours in Huddersfield."
        }
    ]
}